In [8]:
import pandas as pd
df= pd.DataFrame([10,20,30,40],
                columns= ['numbers'],
                index = ['a','b','c','d'])
df

   numbers
a       10
b       20
c       30
d       40

In [4]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
df.columns

Index(['numbers'], dtype='object')

In [6]:
df.loc['c']

numbers    30
Name: c, dtype: int64

In [7]:
df.iloc[1:3]

   numbers
b       20
c       30

In [8]:
df.sum()

numbers    100
dtype: int64

In [9]:
df.apply(lambda x:x**2)

   numbers
a      100
b      400
c      900
d     1600

In [10]:
df ** 2

   numbers
a      100
b      400
c      900
d     1600

In [9]:
df['floats']=(1.4,2.5,3.5,4.5)

In [10]:
df

   numbers  floats
a       10     1.4
b       20     2.5
c       30     3.5
d       40     4.5

In [5]:
df['floats']

a    1.4
b    2.5
c    3.5
d    4.5
Name: floats, dtype: float64

In [11]:
df['names']=pd.DataFrame(['Yves','Sandra','Lili','Henry'],index=['d','a','b','c'])

In [3]:
df

   numbers   names
a       10  Sandra
b       20    Lili
c       30   Henry
d       40    Yves

In [8]:
df.append({'numbers':100, 'floats':5.75,'names':'Jil'},
         ignore_index=True)

   numbers  floats   names
0       10    1.40  Sandra
1       20    2.50    Lili
2       30    3.50   Henry
3       40    4.50    Yves
4      100    5.75     Jil

In [9]:
df.append(pd.DataFrame({'numbers':100,'floats':5.75,'names':'Jil'},index=['y',]))

   numbers  floats   names
a       10    1.40  Sandra
b       20    2.50    Lili
c       30    3.50   Henry
d       40    4.50    Yves
y      100    5.75     Jil

In [12]:
df=df.append(pd.DataFrame({'names':'Liz'},index=['z',]),sort=False)
df

   numbers  floats   names
a     10.0     1.4  Sandra
b     20.0     2.5    Lili
c     30.0     3.5   Henry
d     40.0     4.5    Yves
z      NaN     NaN     Liz

In [13]:
df.dtypes

numbers    float64
floats     float64
names       object
dtype: object

In [15]:
df

   numbers  floats   names
a     10.0     1.4  Sandra
b     20.0     2.5    Lili
c     30.0     3.5   Henry
d     40.0     4.5    Yves
z      NaN     NaN     Liz

In [16]:
df[['numbers','floats']].mean()

numbers    25.000
floats      2.975
dtype: float64

In [17]:
df[['numbers','floats']].std()

numbers    12.909944
floats      1.330100
dtype: float64